Revit 2027 API
BuiltInFailures.DetailFailures.NeedsTwoToAlignEaves Property
 At least two Slope Defining Lines are needed to perform Align Eaves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NeedsTwoToAlignEaves { get; }
Public Shared ReadOnly Property NeedsTwoToAlignEaves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NeedsTwoToAlignEaves {
	FailureDefinitionId^ get ();
}
static member NeedsTwoToAlignEaves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DetailFailures Class
Autodesk.Revit.DB Namespace